Documents/UnitTestResults/SAPPLI_ReceiveRequest_1Lines.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body xmlns:ns1="http://www.reuters.com/ns/2007/01/25/GCAP/EAI/SAP/PLI/ProductPricing">
        <ns1:SAPProductPricing>
            <Header_Details>
                <PPLID>1-10013</PPLID>
                <ZGPLI>A</ZGPLI>
                <ZSB_MATNR>A</ZSB_MATNR>
                <ZSB_PRDNM>A</ZSB_PRDNM>
                <ZSB_PRLVL>A</ZSB_PRLVL>
                <ZSB_PRDSTS>A</ZSB_PRDSTS>
                <ZSB_QTTYP>A</ZSB_QTTYP>
                <ZSB_RVTYP>A</ZSB_RVTYP>
                <ZSB_PRDTYP>A</ZSB_PRDTYP>
                <ZSB_PRDESC>A</ZSB_PRDESC>
                <ZSB_SC3>A</ZSB_SC3>
                <ZSB_GADIS>A</ZSB_GADIS>
                <ZSB_TRGA>A</ZSB_TRGA>
                <ZSB_PRDLN>A</ZSB_PRDLN>
                <ZSB_FRTRL>A</ZSB_FRTRL>
                <ZSB_MNPRMSN>A</ZSB_MNPRMSN>
                <ZSB_WLCL>A</ZSB_WLCL>
                <ZSB_CLTRNG>A</ZSB_CLTRNG>
                <ZSB_SRVPRD>A</ZSB_SRVPRD>
                <ZSB_COMMAPP>A</ZSB_COMMAPP>
                <ZSB_CONSPN>A</ZSB_CONSPN>
                <ZSB_SLACAT>A</ZSB_SLACAT>
                <ZSB_PRDLTYP>A</ZSB_PRDLTYP>
                <ZSB_PRDUTYP>A</ZSB_PRDUTYP>
                <ZSB_SPRCALL>A</ZSB_SPRCALL>
                <ZSB_DVCE>A</ZSB_DVCE>
                <ZSB_AUTOPRMSN>A</ZSB_AUTOPRMSN>
                <ZSB_ASSCAT>A</ZSB_ASSCAT>
                <ZSB_WLEML>A</ZSB_WLEML>
                <ZSB_GUAHRS>A</ZSB_GUAHRS>
                <ZSB_STB>A</ZSB_STB>
                <ZSB_PRKEY>A</ZSB_PRKEY>
                <ZSB_PRMPRMSN>A</ZSB_PRMPRMSN>
                <ZSB_BLPLT>A</ZSB_BLPLT>
                <ZSB_CNVASS>A</ZSB_CNVASS>
                <ZSB_TCHAPP>A</ZSB_TCHAPP>
                <ZSB_TCHFLFL>A</ZSB_TCHFLFL>
                <ZSB_MRGCAT>A</ZSB_MRGCAT>
                <ZSB_PRDAPPRQ>A</ZSB_PRDAPPRQ>
                <ZSB_GLBPRCPRD>A</ZSB_GLBPRCPRD>
                <ZSB_ELPRIC>A</ZSB_ELPRIC>
                <ZSB_AGRTYP>A</ZSB_AGRTYP>
                <ZSB_ORDBL>A</ZSB_ORDBL>
                <ZSB_VSBL>A</ZSB_VSBL>
                <ZSB_SRVTYP>A</ZSB_SRVTYP>
                <ZSB_LCPLI>A</ZSB_LCPLI>
                <ZSB_RIN>A</ZSB_RIN>
                <ZSB_DISCGRP>A</ZSB_DISCGRP>
                <ZSB_SNVLDISC>A</ZSB_SNVLDISC>
                <ZSB_MNVLDISC>A</ZSB_MNVLDISC>
                <ZSB_CONTRCAT>A</ZSB_CONTRCAT>
                <ZSB_LICTYP>A</ZSB_LICTYP>
                <ZSB_3RYGRP>A</ZSB_3RYGRP>
                <ZSB_EMBSWPRD>A</ZSB_EMBSWPRD>
                <ZSB_MNFPTNUM>A</ZSB_MNFPTNUM>
                <ZSB_MNFCTNAME>A</ZSB_MNFCTNAME>
                <ZSB_SOLAPP>A</ZSB_SOLAPP>
                <ZSB_EMRGPRT>A</ZSB_EMRGPRT>
                <ZSB_MAINTPRD>A</ZSB_MAINTPRD>
                <ZSB_OPRSYS>A</ZSB_OPRSYS>
                <ZSB_SOLMAINTPRD>A</ZSB_SOLMAINTPRD>
                <ZSB_INVBANK>A</ZSB_INVBANK>
                <ZSB_BUSCLS>A</ZSB_BUSCLS>
                <ZSB_BILL>A</ZSB_BILL>
                <ZSB_TPRS>A</ZSB_TPRS>
                <ZSB_BQTY>A</ZSB_BQTY>
                <ZSB_OPPRD>A</ZSB_OPPRD>
                <ZSB_SLATM>A</ZSB_SLATM>
                <ZSB_MAPER>A</ZSB_MAPER>
                <ZSB_ADPER>A</ZSB_ADPER>
                <ZSB_GUPER>A</ZSB_GUPER>
                <MAKTX>A</MAKTX>
                <Item_Details>
                    <PRICID>L1</PRICID>
                    <ZPLNM>L1</ZPLNM>
                    <DATBI>L1</DATBI>
                    <DATAB>L1</DATAB>
                    <ZLPRIC>L1</ZLPRIC>
                    <ZCURR_CODE>L1</ZCURR_CODE>
                    <ZSB_INACT>L1</ZSB_INACT>
                    <ZSB_PLIPER>L1</ZSB_PLIPER>
                    <ZSB_LCLSTS>L1</ZSB_LCLSTS>
                    <ZSB_LCLPLI>L1</ZSB_LCLPLI>
                    <ZSB_IGNOR>L1</ZSB_IGNOR>
                    <ZSB_LCLPLILNG>L1</ZSB_LCLPLILNG>
                </Item_Details>
				 <Item_Details>
                    <PRICID>L2</PRICID>
                    <ZPLNM>L2</ZPLNM>
                    <DATBI>L2</DATBI>
                    <DATAB>L2</DATAB>
                    <ZLPRIC>L2</ZLPRIC>
                    <ZCURR_CODE>L2</ZCURR_CODE>
                    <ZSB_INACT>L2</ZSB_INACT>
                    <ZSB_PLIPER>L2</ZSB_PLIPER>
                    <ZSB_LCLSTS>L2</ZSB_LCLSTS>
                    <ZSB_LCLPLI>L2</ZSB_LCLPLI>
                    <ZSB_IGNOR>L2</ZSB_IGNOR>
                    <ZSB_LCLPLILNG>L2</ZSB_LCLPLILNG>
                </Item_Details>
				<Item_Details>
                    <PRICID>L3</PRICID>
                    <ZPLNM>L3</ZPLNM>
                    <DATBI>L3</DATBI>
                    <DATAB>L3</DATAB>
                    <ZLPRIC>L3</ZLPRIC>
                    <ZCURR_CODE>L3</ZCURR_CODE>
                    <ZSB_INACT>L3</ZSB_INACT>
                    <ZSB_PLIPER>L3</ZSB_PLIPER>
                    <ZSB_LCLSTS>L3</ZSB_LCLSTS>
                    <ZSB_LCLPLI>L3</ZSB_LCLPLI>
                    <ZSB_IGNOR>L3</ZSB_IGNOR>
                    <ZSB_LCLPLILNG>L2</ZSB_LCLPLILNG>
                </Item_Details>
            </Header_Details>
        </ns1:SAPProductPricing>
    </soap:Body>
</soap:Envelope>
